const messages = {
  'threeSubjects': `
1.    ينبغي اختيار المواد التي ترغب في دراستها في الفصل الصيفي من القائمة المذكورة بعد نهاية التعليمات.
2.    يمكنك اختيار 3 مواد دراسية بحد أقصى لدراستها في الصيفي.
3.    تكون إعادة المواد عن طريق الامتحان النهائي فقط ويحتسب من 100 درجة ولا يكون هناك أنشطة أو فصول افتراضية أو اختبار منتصف. فيما عدا القرآن الكريم يتم احتسابه (التلاوة من: 40 والتحريري: من 60) بشرط ألا يقل الطالب عن (20 درجة في التلاوة، و 30 درجة في التحريري).
4.    لن تتمكن من استخدام البوابة إلا بعد عملية اختيار المواد.
5.    سيتم تفعيل السداد بعد انتهاء عملية الاختيار.
6.    تكون إعادة المواد عن طريق الامتحان النهائي فقط ويحتسب من 100 درجة ولا يكون هناك أنشطة أو فصول افتراضية أو اختبار منتصف.
7.    في حال –لا قدر الله- أخفق الطالب في اجتياز المواد التي سجلها في الفصل الصيفي وظل عدد المواد التي لم يجتزها 4 مواد يترتب عليه إعادة سنة دراسية كاملة في تلك المواد.
8.    إذا لم يتم تسجيل أي مادة في الصيفي يترتب عليه أمرين:
‌أ.       عدم إمكانية استخدام البوابة لمدة أسبوع حتى ينتهي باقي الطلاب من اختيار المواد.
‌ب.  إعادة سنة دراسية كاملة في مواد الرسوب فقط.`,
'fourSubjects': `
1.    ينبغي اختيار المواد التي ترغب في دراستها في الفصل الصيفي من القائمة المذكورة بعد نهاية التعليمات.
2.    يمكنك اختيار 3 مواد دراسية بحد أقصى لدراستها في الصيفي.
3.    تكون إعادة المواد عن طريق الامتحان النهائي فقط ويحتسب من 100 درجة ولا يكون هناك أنشطة أو فصول افتراضية أو اختبار منتصف. فيما عدا القرآن الكريم يتم احتسابه (التلاوة من: 40 والتحريري: من 60) بشرط ألا يقل الطالب عن (20 درجة في التلاوة، و 30 درجة في التحريري).
4.    لن تتمكن من استخدام البوابة إلا بعد عملية اختيار المواد.
5.    سيتم تفعيل السداد بعد انتهاء عملية الاختيار.
6.    تكون إعادة المواد عن طريق الامتحان النهائي فقط ويحتسب من 100 درجة ولا يكون هناك أنشطة أو فصول افتراضية أو اختبار منتصف.
7.    في حال –لا قدر الله- أخفق الطالب في اجتياز المواد التي سجلها في الفصل الصيفي وظل عدد المواد التي لم يجتزها 4 مواد يترتب عليه إعادة سنة دراسية كاملة في تلك المواد.
8.    إذا لم يتم تسجيل أي مادة في الصيفي يترتب عليه أمرين:
‌أ.       عدم إمكانية استخدام البوابة لمدة أسبوع حتى ينتهي باقي الطلاب من اختيار المواد.
‌ب.  إعادة سنة دراسية كاملة في مواد الرسوب فقط إذا كانت أكثر من خمسة مواد.
`,
'diploma': `
1.    ينبغي اختيار جميع المواد في القائمة التالية.
2.    لن تتمكن من استخدام البوابة إلا بعد عملية اختيار المواد.
3.    سيتم تفعيل السداد بعد انتهاء عملية الاختيار.
4.    دراسة هذه المواد تشمل (مشاهدة المحاضرات المتلفزة، والفصول الافتراضية، والاختبار القصير، واختبار منتصف، واختبار نهائي).
5.    في حال –لا قدر الله- أخفق الطالب في اجتياز كل أو بعض المواد فيمكنه إعادتها في الفصل الأول من العام الدراسي 2017-2018.
6.    الذي لا يرغب في التسجيل في الفصل الصيفي الحالي يترتب عليه:
‌أ.       لن يتمكن من استخدام البوابة لمدة أسبوع حتى ينتهي باقي الطلاب من عملية الاختيار.
‌ب.  يدرس مواد الدبلوم المتبقية له في الفصل الأول من العام الدراسي 2017-2018.
`,
'bac': `
1.    إذا كنت ترغب في التخرج بعد انتهاء الفصل الصيفي ينبغي اختيار جميع المواد في القائمة التالية.
2.    بالنسبة لمادة القرآن الكريم يختار الطالب المادة من القائمة (لمن يرغب في إعادتها في الصيفي) وعند  احتساب الرسوم وامتحان الإعادة يُعامل وفق الجانب الذي أخفق فيه فقط.
3.    لن تتمكن من استخدام البوابة إلا بعد عملية اختيار المواد.
4.    سيتم تفعيل السداد بعد انتهاء عملية الاختيار من جميع الطلاب.
5.    تكون إعادة المواد عن طريق الامتحان النهائي فقط ويحتسب من 100 درجة ولا يكون هناك أنشطة أو فصول افتراضية أو اختبار منتصف. فيما عدا القرآن الكريم يتم احتسابه (التلاوة من: 40 والتحريري: من 60) بشرط ألا يقل الطالب عن (20 درجة في التلاوة، و 30 درجة في التحريري).
6.    في حال –لا قدر الله- أخفق الطالب في اجتياز كل أو بعض المواد في الفصل الصيفي الحالي يمكنه إعادتها في الفصل الدراسي الذي تندرج تحته المادة وفقًا للخطة الدراسية.
7.    الذي لا يرغب في التسجيل في الفصل الصيفي الحالي يترتب عليه:
‌أ.       لن يتمكن من استخدام البوابة لمدة أسبوع حتى ينتهي باقي الطلاب من عملية الاختيار.
‌ب.  إعادة سنة دراسية كاملة في تلك المواد.
`
}

export default messages
